# Création d'un jeu de donnée simple (dataframe)

In [2]:
import pandas as pd

pd.DataFrame({'Colonne 1': [1], 'Colonne 2': [2]})

   Colonne 1  Colonne 2
0          1          2

# Modification des libellés

In [3]:
pd.DataFrame({'Colonne 1': [35, 41], 'Colonne 2': [1, 2]}, index=['Ligne 1', 'Ligne 2'])

         Colonne 1  Colonne 2
Ligne 1         35          1
Ligne 2         41          2

# Création d'une série

In [4]:
pd.Series(["Valeur1", "Valeur2", "Valeur3", "Valeur4"], index=["Index1", "Index2", "Index3", "Index4"], name='Ma série')

Index1    Valeur1
Index2    Valeur2
Index3    Valeur3
Index4    Valeur4
Name: Ma série, dtype: object

# Lecture d'un fichier CSV

## Première lignes

In [5]:
csv = pd.read_csv("../datasources/housing/housing.csv")
csv.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY

## métadonnées

In [7]:
csv.describe()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
count,20640.000000,20640.000000,20640.000000,20640.000000,20433.000000,20640.000000,20640.000000,20640.000000,20640.000000
mean,-119.569704,35.631861,28.639486,2635.763081,537.870553,1425.476744,499.539680,3.870671,206855.816909
std,2.003532,2.135952,12.585558,2181.615252,421.385070,1132.462122,382.329753,1.899822,115395.615874
min,-124.350000,32.540000,1.000000,2.000000,1.000000,3.000000,1.000000,0.499900,14999.000000
25%,-121.800000,33.930000,18.000000,1447.750000,296.000000,787.000000,280.000000,2.563400,119600.000000
50%,-118.490000,34.260000,29.000000,2127.000000,435.000000,1166.000000,409.000000,3.534800,179700.000000
75%,-118.010000,37.710000,37.000000,3148.000000,647.000000,1725.000000,605.000000,4.743250,264725.000000
max,-114.310000,41.950000,52.000000,39320.000000,6445.000000,35682.000000,6082.000000,15.000100,500001.000000

## Dernières lignes

In [8]:
csv.tail()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
20635,-121.09,39.48,25.0,1665.0,374.0,845.0,330.0,1.5603,78100.0,INLAND
20636,-121.21,39.49,18.0,697.0,150.0,356.0,114.0,2.5568,77100.0,INLAND
20637,-121.22,39.43,17.0,2254.0,485.0,1007.0,433.0,1.7000,92300.0,INLAND
20638,-121.32,39.43,18.0,1860.0,409.0,741.0,349.0,1.8672,84700.0,INLAND
20639,-121.24,39.37,16.0,2785.0,616.0,1387.0,530.0,2.3886,89400.0,INLAND

## dimensions du dataframe

In [9]:
csv.shape

(20640, 10)

## Affichage du fichier csv

In [10]:
pd.set_option("display.max_rows", 5)
csv

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
...,...,...,...,...,...,...,...,...,...,...
20638,-121.32,39.43,18.0,1860.0,409.0,741.0,349.0,1.8672,84700.0,INLAND
20639,-121.24,39.37,16.0,2785.0,616.0,1387.0,530.0,2.3886,89400.0,INLAND

## Accès aux données (index)

### Accès à un vecteur (colonne)

In [9]:
csv.longitude

0       -122.23
1       -122.22
          ...
20638   -121.32
20639   -121.24
Name: longitude, Length: 20640, dtype: float64

In [16]:
csv["longitude"]

0       -122.23
1       -122.22
          ...
20638   -121.32
20639   -121.24
Name: longitude, Length: 20640, dtype: float64

### Accès à une cellule

In [10]:
csv.longitude[0]

-122.23

In [17]:
csv["longitude"][0]

-122.23

### Récupération des 4 premières colonnes & 3 premières lignes

In [11]:
csv.iloc[:3, :4]

   longitude  latitude  housing_median_age  total_rooms
0    -122.23     37.88                41.0        880.0
1    -122.22     37.86                21.0       7099.0
2    -122.24     37.85                52.0       1467.0

### Filtrage sur colonnes (via labels)

In [12]:
csv.loc[:, ('longitude', 'latitude')]

       longitude  latitude
0        -122.23     37.88
1        -122.22     37.86
...          ...       ...
20638    -121.32     39.43
20639    -121.24     39.37

[20640 rows x 2 columns]